app/controllers/todolists_controller.rb

  def create
  	# ストロングパラメーターを使用
  	list = List.new(list_params)
  	# DBへ保存する
  	list.save
---
INSERT INTO "lists" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "railsの勉強"], ["body", "投稿機能を作る！"], ["created_at", "2020-06-09 06:34:07.844267"], ["updated_at", "2020-06-09 06:34:07.844267"]]

  def index
    @lists = List.all
---
SELECT "lists".* FROM "lists"

  def show
    @list = List.find(params[:id])
---
SELECT  "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

  def edit
    @list =List.find(params[:id])
---
SELECT  "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    list = List.find(params[:id])
    list.update(list_params)
---
SELECT  "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "lists" SET "body" = ?, "updated_at" = ? WHERE "lists"."id" = ?  [["body", "投稿機能を作りました！"], ["updated_at", "2020-06-09 12:27:49.113387"], ["id", 1]]

  def destroy
      list = List.find(params[:id]) #データ(レコード）を1件取得
      list.destroy #データ(レコード)を削除
      redirect_to todolists_path #List一覧画面へリダイレクト
  end

	private

	def list_params
		params.require(:list).permit(:title, :body, :image)
	end

end
---
DELETE FROM "lists" WHERE "lists"."id" = ?  [["id", 1]]
SELECT  "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]